# Упражнение 1
#
имя = ноль
фамилия = ноль
возраст = ноль


def hello (имя, фамилия, возраст)
 если возраст
 puts "Привет, #{name} #{lastname}. Тебе меньше 18 лет, но начать учиться программировать никогда не рано"
 ещё
 puts "Привет, #{name} #{lastname}. Самое время заняться делом!"
 конец
конец

напечатать " имя? "
имя = получает
print "Lastname? "
lastname = gets
print "Age? "
age = gets.to_i

Здравствуйте(Имя, фамилия, возраст)



# Упражнение 2

а = ноль
b = ноль

 defnumber(a, b)
 если a= = 20 или b= = 20
 ставит 20
 ещё
 ставит a+b
 конец
конец

печать " номер а: "
a = получает.to_i
печать " номер b: "
b = получает.to_i

число(a, b)
